Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType
A RebarShapeDefinitionByArc takes one of three forms.

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType.Spiral
A helical bar. The extent of the helix is determined
by the Rebar properties Height and Pitch.

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType.LappedCircle
A full circle, subtending an angle more
than 360 degrees and less than 720 degrees. The
behavior in Revit is the same as Arc, but an extra
complete circle is included in the rebar.

Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType.Arc
An arc, subtending an angle less than 360 degrees.